<?php

return [
    'sign_in' => 'Войти',
    'go_to_login' => 'Залогинится',
    'failed' => 'Не удалось найти учетную запись, соответствующую этим учетным данным.',

    'forgot_password' => [
        'label' => 'Забыли пароль?',
        'label_help' => 'Введите адрес электронной почты своей учетной записи, чтобы получить инструкции по сбросу пароля.',
        'button' => 'Запасной аккаунт',
    ],

    'reset_password' => [
        'button' => 'Сбросить пароль и перезайти?',
    ],

    'two_factor' => [
        'label' => 'Токен 2-Факторной Аунтефикации',
        'label_help' => 'Для продолжения работы этой учетной записи требуется второй уровень аутентификации. Пожалуйста, введите код, сгенерированный вашим устройством, чтобы завершить этот вход.',
        'checkpoint_failed' => 'Токен 2-Факторной Аунтефикации неверен.',
    ],

    'throttle' => 'Очень много попыток войти в панель. Попробуйте снова через :seconds секунд.',
    'password_requirements' => 'Пароль должен быть длиной не менее 8 символов и должен быть уникальным для данной Панели.',
    '2fa_must_be_enabled' => 'Администратор потребовал, чтобы для вашей учетной записи была включена 2-факторная аутентификация, чтобы использовать Панель.',
];
