<?php

return [
    'daemon_connection_failed' => 'Произошло исключение при попытке связаться с демоном, что привело к HTTP/:code код ответа. Это исключение было зарегистрировано.',
    'node' => [
        'servers_attached' => 'Нода не должна иметь серверов, связанных с ней, чтобы быть удаленной.',
        'daemon_off_config_updated' => 'Конфигурация демона <strong>была обновлена</strong>, however there was an error encountered while attempting to automatically update the configuration file on the Daemon. You will need to manually update the configuration file (config.yml) for the daemon to apply these changes.однако при попытке автоматического обновления файла конфигурации на демоне произошла ошибка. Вам потребуется вручную обновить файл конфигурации (config.yml), чтобы демон применил эти изменения.',
    ],
    'allocations' => [
        'server_using' => 'В настоящее время этому расположению назначен сервер. Выделение может быть удалено только в том случае, если в данный момент сервер не назначен.',
        'too_many_ports' => 'Одновременное добавление более 1000 портов в одном диапазоне не поддерживается.',
        'invalid_mapping' => 'Отображение, предусмотренное для :port было недействительно и не могло быть обработано.',
        'cidr_out_of_range' => 'Нотация CIDR позволяет использовать маски только в диапазоне от /25 до /32.',
        'port_out_of_range' => 'Порты в выделении должны быть больше 1024 и меньше или равны 65535.',
    ],
    'nest' => [
        'delete_has_servers' => 'Ядроо с подключенными к нему активными серверами нельзя удалить с панели.',
        'egg' => [
            'delete_has_servers' => 'Ядро с подключенными к нему активными серверами не может быть удалено с панели.',
            'invalid_copy_id' => 'Ядро, выбранное для копирования сценария, либо не существует, либо копирует сам сценарий.',
            'must_be_child' => 'Директива "Копировать настройки из" для этого ядра должна быть дочерней опцией для выбранного ядра.',
            'has_children' => 'Это ядро является родителем одного или нескольких других ядер. Пожалуйста, удалите эти ядра, прежде чем удалять это ядро.',
        ],
        'variables' => [
            'env_not_unique' => 'Переменная среды :name должна быть уникальной для этого ядра.',
            'reserved_name' => 'Переменная среды :name защищена и не может быть присвоена переменной.',
            'bad_validation_rule' => 'Правило проверки ":rule" не является допустимым правилом для этого приложения.',
        ],
        'importer' => [
            'json_error' => 'Произошла ошибка при попытке проанализировать файл JSON: :error.',
            'file_error' => 'Предоставленный файл JSON был недействителен.',
            'invalid_json_provided' => 'Предоставленный файл JSON не имеет формата, который можно распознать.',
        ],
    ],
    'subusers' => [
        'editing_self' => 'Редактирование вашей собственной учетной записи субпользователя не допускается.',
        'user_is_owner' => 'Вы не можете добавить владельца сервера в качестве дополнительного пользователя для этого сервера.',
        'subuser_exists' => 'Пользователь с таким адресом электронной почты уже назначен в качестве дополнительного пользователя для этого сервера.',
    ],
    'databases' => [
        'delete_has_databases' => 'Невозможно удалить сервер узла базы данных, к которому подключены активные базы данных.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максимальное время интервала для последовательной задачи составляет 15 минут.',
    ],
    'locations' => [
        'has_nodes' => 'Невозможно удалить местоположение, к которому прикреплены активные ноды.',
    ],
    'users' => [
        'node_revocation_failed' => 'Не удалось отозвать ключи на <a href=":link">ноде #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Не удалось найти ноды, удовлетворяющих требованиям, указанным для автоматического развертывания.',
        'no_viable_allocations' => 'Не было найдено расположений, удовлетворяющих требованиям для автоматического развертывания.',
    ],
    'api' => [
        'resource_not_found' => 'Запрошенный ресурс не существует на этом сервере.',
    ],
];
