<?php
/**
 * Pterodactyl - Panel
 * Copyright (c) 2015 - 2017 Dane Everitt <dane@daneeveritt.com>.
 *
 * This software is licensed under the terms of the MIT license.
 * https://opensource.org/licenses/MIT
 */

return [
    'notices' => [
        'created' => 'Новое ядро, :name, успешно создано.',
        'deleted' => 'Успешно удалил запрошенное ядро с панели.',
        'updated' => 'Успешно обновлены параметры конфигурации ядра.',
    ],
    'eggs' => [
        'notices' => [
            'imported' => 'Ядро и связанные с ним переменные успешно импортированы.',
            'updated_via_import' => 'Это ядро было обновлено с помощью предоставленного файла.',
            'deleted' => 'Успешно удалил запрошенное ядро с панели.',
            'updated' => 'Конфигурация ядра была успешно обновлена.',
            'script_updated' => 'Скрипт установки ядра был обновлен и будет запускаться всякий раз, когда будут установлены серверы.',
            'egg_created' => 'Новое ядро было успешно установлено. Вам нужно будет перезапустить всех запущенных демонов, чтобы применить это новое ядро.',
        ],
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'Переменная ":variable" была удалена и больше не будет доступна для серверов после восстановления.',
            'variable_updated' => 'Переменная ":variable" была обновлена. Вам нужно будет перестроить все серверы, используя эту переменную, чтобы применить изменения.',
            'variable_created' => 'Новая переменная успешно создана и назначена этому ядру.',
        ],
    ],
];
