<?php
/**
 * Pterodactyl - Panel
 * Copyright (c) 2015 - 2017 Dane Everitt <dane@daneeveritt.com>.
 *
 * This software is licensed under the terms of the MIT license.
 * https://opensource.org/licenses/MIT
 */

return [
    'exceptions' => [
        'no_new_default_allocation' => 'Вы пытаетесь удалить IP адресс по умолчанию для этого сервера, но нет резервного IP для использования.',
        'marked_as_failed' => 'Этот сервер был помечен как не прошедший предыдущую установку. Текущее состояние не может быть переключено в этом состоянии.',
        'bad_variable' => 'Произошла ошибка проверки с переменной :name.',
        'daemon_exception' => 'При попытке связаться с демоном возникло исключение, в результате чего был получен код ответа HTTP/:code. Это исключение было зарегистрировано. (request id: :request_id)',
        'default_allocation_not_found' => 'The requested default allocation was not found in this server\'s allocations.',
    ],
    'alerts' => [
        'startup_changed' => 'Конфигурация запуска для этого сервера была обновлена. Если ядро этого сервера было изменено, сейчас произойдет переустановка.',
        'server_deleted' => 'Сервер успешно удален из системы.',
        'server_created' => 'Сервер был успешно создан на панели. Пожалуйста, дайте нам несколько минут, чтобы полностью установить этот сервер.',
        'build_updated' => 'Сведения о сборке для этого сервера были обновлены. Для вступления в силу некоторых изменений может потребоваться перезапуск.',
        'suspension_toggled' => 'Статус приостановки сервера был изменен на :status.',
        'rebuild_on_boot' => 'Этот сервер был помечен как требующий перестройки контейнера Docker. Это произойдет при следующем запуске сервера.',
        'install_toggled' => 'Статус установки для этого сервера был изменен.',
        'server_reinstalled' => 'Этот сервер был поставлен в очередь на переустановку, начинающуюся сейчас.',
        'details_updated' => 'Сведения о сервере успешно обновлены.',
        'docker_image_updated' => 'Успешно изменен образ настройки по умолчанию для использования на этом сервере. Для применения этого изменения требуется перезагрузка.',
        'node_required' => 'У вас должна быть настроена хотя бы одна нода, прежде чем вы сможете добавить сервер на эту панель.',
        'transfer_nodes_required' => 'Перед передачей серверов необходимо настроить по крайней мере две ноды.',
        'transfer_started' => 'Начата передача сервера.',
        'transfer_not_viable' => 'Выбранная вами нода не располагает необходимым дисковым пространством или памятью для размещения этого сервера.',
    ],
];
